<template>
    <div>
    <!--https://www.vuemastery.com/pdf/Nuxtjs-Cheat-Sheet.pdf-->
    <h1>hello world</h1>
    <!--
    Но допустим мы хотим True SSR, тогда как вариант мы можем пользоваться методом asyncData родительской страницы. Это усложняет проект, так как где бы мы не хотели отрендерить список товаров, родитель должно контролировать эти списки и получать для них данные. Ужасно, медленно, неудобно, но мы получим труSSR.
    -->
    <!-- todo: breadcrumbs-->
    <!-- todo: + i18n https://github.com/nuxt/nuxt.js/blob/dev/examples/i18n/middleware/i18n.js -->
    <hr>
    notifications (add to cart)
    themes
    i18n
    protected routes
    Отдельный роут в модальном окне
?    Хранение идентификатора пользователя в cookie (без авторизации для упрощения).
    Ленивая подгрузка и гидрация компонентов.
-    Сжатие изображений, стилей, скриптов, html кода и всего что только можно.
    2 версии сайта: 1) для последних браузеров которым не нужен транспилированный код (через Babel) 2) Legacy версия транспилированная через Babel.
-    Умная загрузка шрифтов без FOUT, FOIT, FOFT (распространённая проблема при использовании своих шрифтов, пока они не загрузятся у пользователя, он не будет видеть текст).
    Поддержка всех браузеров от IE 10.
-    Поддержка svg.
    Работа со всеми SEO тегами.
?    Автоопределение устройства пользователя ещё до рендера сайта, для отдачи нужного html контента.
    Работа с API с помощью XHR запросов.
    </div>
</template>

<script>
  export default {
    name: 'index',
    head: {
      title: 'Домашнаяя страница'
    }
  }
</script>

<style scoped>

</style>
